Тестовая_база_ERP_14/src/InformationRegisters/CRM_НастройкиРасположенияЭлементовНаФормах/CRM_НастройкиРасположенияЭлементовНаФормах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CRM_НастройкиРасположенияЭлементовНаФормах</name>
  <resources>
    <name>ЗаголовокЭлемента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИмяЭлементаРазмещения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПорядокРасположения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ИмяФормы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяЭлемента</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Тестовая_база_ERP_14/src/Documents/CRM_Интерес/CRM_Интерес.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>CRM_Интерес</name>
  <comment>Интерес</comment>
  <basedOn>Document.CRM_Интерес</basedOn>
  <basedOn>Catalog.Партнеры</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>Автор</name>
    <comment>Автор документа</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВероятностьСделки</name>
    <comment>Вероятность сделки в процентах</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <comment>Документ основание</comment>
    <type>
      <types>CatalogRef.МаркетинговыеМероприятия</types>
      <types>DocumentRef.CRM_Интерес</types>
      <types>DocumentRef.CRM_РассылкаЭлектронныхПисем</types>
      <types>DocumentRef.ЭлектронноеПисьмоИсходящее</types>
      <types>DocumentRef.ЭлектронноеПисьмоВходящее</types>
      <types>DocumentRef.ТелефонныйЗвонок</types>
      <types>DocumentRef.CRM_Телемаркетинг</types>
      <types>TaskRef.ЗадачаИсполнителя</types>
      <types>DocumentRef.CRM_Заявка</types>
      <types>BusinessProcessRef.CRM_БизнесПроцесс</types>
      <types>DocumentRef.УдалитьCRM_Сделка</types>
      <types>DocumentRef.КоммерческоеПредложениеКлиенту</types>
      <types>DocumentRef.УдалитьCRM_Событие</types>
      <types>DocumentRef.CRM_СообщениеМессенджера</types>
    </type>
  </attributes>
  <attributes>
    <name>Завершен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Избранный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <comment>Контактное лицо</comment>
    <type>
      <types>CatalogRef.КонтактныеЛицаПартнеров</types>
    </type>
  </attributes>
  <attributes>
    <name>ОжидаемаяВыручка</name>
    <comment>Ожидаемая выручка</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <comment>Описание</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <comment>Организация</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <comment>Ответственный</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Офис</name>
    <comment>Офис подразделения</comment>
    <type>
      <types>CatalogRef.CRM_ОфисыКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <comment>Клиент</comment>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>СделкаСКлиентом</name>
    <comment>Только для объединенных решений</comment>
    <type>
      <types>CatalogRef.СделкиСКлиентами</types>
    </type>
  </attributes>
  <attributes>
    <name>Соглашение</name>
    <comment>Только для объединенных решений</comment>
    <type>
      <types>CatalogRef.СоглашенияСКлиентами</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <comment>Подразделение ответственного</comment>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ПотенциальныйКлиент</name>
    <comment>Потенциальный клиент</comment>
    <type>
      <types>CatalogRef.CRM_ПотенциальныеКлиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОтказа</name>
    <comment>Причина отказа</comment>
    <type>
      <types>CatalogRef.CRM_ПричиныОтказаПоИнтересам</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеИнтереса</name>
    <comment>Состояние интереса</comment>
    <type>
      <types>CatalogRef.CRM_СостоянияИнтересов</types>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <comment>Тема</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипУслуги</name>
    <comment>Тип услуги</comment>
    <type>
      <types>CatalogRef.CRM_ТипУслуги</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НалогообложениеНДС</name>
    <type>
      <types>EnumRef.ТипыНалогообложенияНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>СкидкиРассчитаны</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>CRM_Теги</name>
    <attributes>
      <name>Тег</name>
      <type>
        <types>CatalogRef.CRM_Теги</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ОсталосьОтгрузить</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отгружено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентРучнойСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Содержание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидЦены</name>
      <type>
        <types>CatalogRef.ВидыЦен</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРучнойСкидки</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентАвтоматическойСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаАвтоматическойСкидки</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураНабора</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНабора</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СкидкиНаценки</name>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СкидкаНаценка</name>
      <type>
        <types>CatalogRef.СкидкиНаценки</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
      </type>
    </attributes>
    <attributes>
      <name>НапомнитьПозже</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Тестовая_база_ERP_14/src/CommonModules/CRM_УправлениеЭлементамиНаФормах/Module.bsl
#Область ПрограммныйИнтерфейс

////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции для стандартной обработки дополнительных реквизитов.

// Создает основные реквизиты и поля формы, необходимые для работы.
// Заполняет дополнительные реквизиты, если используются.
// Вызывается из обработчика ПриСозданииНаСервере формы объекта со свойствами.
// 
// Параметры:
//  Форма - УправляемаяФорма - в которой будут отображаться дополнительные реквизиты.
//
//  ДополнительныеПараметры - Неопределено - все дополнительные параметры имеют значения по умолчанию.
//                               Ранее реквизит назывался "Объект" и имел смысл,
//                               как одноименное свойство структуры, указанной ниже.
//                          - Структура - с необязательными свойствами:
//
//
Процедура ПриСозданииНаСервере(Форма, ИмяЭлементаРазмещенияКоманды = "", ДопИмяЭлементаРазмещенияКоманды = "") Экспорт
	
	Если Форма.Параметры.Свойство("РасположениеЭлементовПоУмолчанию") Тогда
		Возврат;
	КонецЕсли;
	ОписаниеФормы = Неопределено;
	Если ОписаниеНастраиваемыхФорм().Свойство(СтрЗаменить(Форма.ИмяФормы, ".", "_"), ОписаниеФормы) Тогда
		
		РазместитьЭлементыПоНастройке(Форма, ОписаниеФормы);
		
		Если CRM_ОбщегоНазначенияСервер.НайтиВМетаданныхПоИмени("Роли", "CRM_НастройкаПрограммы") Тогда
			ДоступноРедактированиеРасположенияЭлементовФормы = РольДоступна("ПолныеПрава") или РольДоступна("CRM_НастройкаПрограммы");
		Иначе
			ДоступноРедактированиеРасположенияЭлементовФормы = РольДоступна("ПолныеПрава");
		КонецЕсли;
		
		Если ДоступноРедактированиеРасположенияЭлементовФормы Тогда
			
			Если ЗначениеЗаполнено(ИмяЭлементаРазмещенияКоманды) Тогда
				ЭлементРазмещенияКоманды = Форма.Элементы.Найти(ИмяЭлементаРазмещенияКоманды);
				Если ЭлементРазмещенияКоманды = Неопределено Тогда
					Возврат;
				КонецЕсли;	
			Иначе 
				ЭлементРазмещенияКоманды = Форма.Элементы.Найти("КоманднаяПанельФормы");
				Если ЭлементРазмещенияКоманды = Неопределено Тогда
					Возврат;
				КонецЕсли;	
			КонецЕсли;
			
			Если Форма.Команды.Найти("НастроитьРасположениеЭлементовФормы") = Неопределено Тогда
				Команда = Форма.Команды.Добавить("НастроитьРасположениеЭлементовФормы");
				Команда.Действие = "Подключаемый_НастройкаРасположенияЭлементовФормы";
				
				КнопкаНастройки = Форма.Элементы.Добавить("НастроитьРасположениеЭлементовФормы", Тип("КнопкаФормы"), ЭлементРазмещенияКоманды);
				КнопкаНастройки.Заголовок = НСтр("ru = 'Настроить состав и расположение полей'");
				КнопкаНастройки.Картинка = БиблиотекаКартинок.CRM_НастройкиРабочийСтол;
				КнопкаНастройки.ИмяКоманды = "НастроитьРасположениеЭлементовФормы";
				КнопкаНастройки.ТолькоВоВсехДействиях = Истина;
				
				Если ЗначениеЗаполнено(ДопИмяЭлементаРазмещенияКоманды) Тогда
					ЭлементРазмещенияКоманды = Форма.Элементы.Найти(ДопИмяЭлементаРазмещенияКоманды);
					Если ЭлементРазмещенияКоманды <> Неопределено Тогда
						КнопкаНастройки = Форма.Элементы.Добавить("ДопНастроитьРасположениеЭлементовФормы", Тип("КнопкаФормы"), ЭлементРазмещенияКоманды);
						КнопкаНастройки.Заголовок = НСтр("ru = 'Настроить поля'");
						КнопкаНастройки.ИмяКоманды = "НастроитьРасположениеЭлементовФормы";
						КнопкаНастройки.ЦветТекста = ЦветаСтиля.CRM_ОсновнойГолубой;
						КнопкаНастройки.ОтображениеФигуры = ОтображениеФигурыКнопки.Нет;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
				
		КонецЕсли;

	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ОписаниеНастраиваемыхФорм() Экспорт
	
	ОписанияФорм = Новый Структура;	
	
	// Новая форма интереса
	#Область НоваяФормаИнтереса
	
	ОписаниеФормы = Новый Структура;
	
	МассивОбластей = новый Массив;
	МассивОбластей.Добавить("ГруппаОсновное");
	МассивОбластей.Добавить("ГруппаДополнительно");
	ОписаниеФормы.Вставить("МассивОбластей", МассивОбластей);
	
	МассивИсключаемыхЭлементов = Новый Массив;
	МассивИсключаемыхЭлементов.Добавить("Ссылка");
	МассивИсключаемыхЭлементов.Добавить("ДекорацияАвторДата");
	МассивИсключаемыхЭлементов.Добавить("ГруппаДополнительныеРеквизиты");
	
	Если НЕ ПолучитьФункциональнуюОпцию("ФиксироватьПервичныйИнтерес") Тогда
		МассивИсключаемыхЭлементов.Добавить("ГруппаОбщиеСведенияИсточникСостояние");
	КонецЕсли;
	
	Если НЕ ПолучитьФункциональнуюОпцию("CRM_ИспользоватьТипыУслуг") Тогда
		МассивИсключаемыхЭлементов.Добавить("ТипУслуги");
	КонецЕсли;
	
	Если НЕ CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM() Тогда
		ИмяФО = "ИспользоватьСделкиСКлиентами";
		Если НЕ ПолучитьФункциональнуюОпцию(ИмяФО) Тогда
			МассивИсключаемыхЭлементов.Добавить("СделкаСКлиентом");
		КонецЕсли;
	КонецЕсли;
	
	ОписаниеФормы.Вставить("МассивИсключаемыхЭлементов", МассивИсключаемыхЭлементов);
	
	СписокНаборовДопРеквизитов = Новый СписокЗначений;
	СписокНаборовДопРеквизитов.Добавить(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_CRM_Интерес);
	ОписаниеФормы.Вставить("СписокНаборовДопРеквизитов", СписокНаборовДопРеквизитов);
	ОписаниеФормы.Вставить("ИмяЭлементаПередКоторымВставлять", "ГруппаСвязанныеСписки");
	
	ОписанияФорм.Вставить(СтрЗаменить("Документ.CRM_Интерес.Форма.ФормаДокументаНовая", ".", "_"), ОписаниеФормы);	
	
	#КонецОбласти
	
	#Область ПартнерыФормаЭлементаНовая
	
	
	Если CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM() Тогда
		
		ОписаниеФормы = Новый Структура;
		
		МассивОбластей = новый Массив;
		МассивОбластей.Добавить("ГруппаСведения");
		МассивОбластей.Добавить("ГруппаДополнительно");
		ОписаниеФормы.Вставить("МассивОбластей", МассивОбластей);
		
		МассивИсключаемыхЭлементов = Новый Массив;
		МассивИсключаемыхЭлементов.Добавить("Ссылка");
		МассивИсключаемыхЭлементов.Добавить("ДекорацияАвторДата");
		МассивИсключаемыхЭлементов.Добавить("ГруппаДополнительныеРеквизиты");
		
		Если НЕ ПолучитьФункциональнуюОпцию("ФиксироватьПервичныйИнтерес") Тогда
			МассивИсключаемыхЭлементов.Добавить("ГруппаПервичныйИнтерес");
		КонецЕсли;
		
		ОписаниеФормы.Вставить("МассивИсключаемыхЭлементов", МассивИсключаемыхЭлементов);
		
		СписокНаборовДопРеквизитов = Новый СписокЗначений;
		СписокНаборовДопРеквизитов.Добавить(Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_Партнеры_Общие);
		СписокНаборовДопРеквизитов.Добавить(Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_Партнеры_Компании_CRM);
		СписокНаборовДопРеквизитов.Добавить(Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_Партнеры_ЧастныеЛица_CRM);
		ОписаниеФормы.Вставить("СписокНаборовДопРеквизитов", СписокНаборовДопРеквизитов);
		ОписаниеФормы.Вставить("ИмяЭлементаПередКоторымВставлять", "ГруппаСвязанныеСписки");
		
		ОписанияФорм.Вставить(СтрЗаменить("Справочник.Партнеры.Форма.CRM_ФормаЭлементаНовая", ".", "_"), ОписаниеФормы);
		
	Иначе
		
		ОписаниеФормы = Новый Структура;
		
		МассивОбластей = новый Массив;
		МассивОбластей.Добавить("ГруппаСведения");
		МассивОбластей.Добавить("ГруппаДополнительно");
		ОписаниеФормы.Вставить("МассивОбластей", МассивОбластей);
		
		МассивИсключаемыхЭлементов = Новый Массив;
		МассивИсключаемыхЭлементов.Добавить("Ссылка");
		МассивИсключаемыхЭлементов.Добавить("ДекорацияАвторДата");
		МассивИсключаемыхЭлементов.Добавить("ГруппаДополнительныеРеквизиты");
		МассивИсключаемыхЭлементов.Добавить("ГруппаОтношения");
		МассивИсключаемыхЭлементов.Добавить("ГруппаОтношенияДополнительно");
		
		Если НЕ ПолучитьФункциональнуюОпцию("ФиксироватьПервичныйИнтерес") Тогда
			МассивИсключаемыхЭлементов.Добавить("ГруппаПервичныйИнтерес");
		КонецЕсли;
		
		ИмяФО = "ИспользоватьГруппыДоступаПартнеров";
		Если НЕ ПолучитьФункциональнуюОпцию(ИмяФО) Тогда
			МассивИсключаемыхЭлементов.Добавить("ГруппаДоступа");
		КонецЕсли;
		
		ОписаниеФормы.Вставить("МассивИсключаемыхЭлементов", МассивИсключаемыхЭлементов);
		
		СписокНаборовДопРеквизитов = Новый СписокЗначений;
		СписокНаборовДопРеквизитов.Добавить(Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_Партнеры_Общие);
		СписокНаборовДопРеквизитов.Добавить(Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_Партнеры_Компании_CRM);
		СписокНаборовДопРеквизитов.Добавить(Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_Партнеры_ЧастныеЛица_CRM);
		ОписаниеФормы.Вставить("СписокНаборовДопРеквизитов", СписокНаборовДопРеквизитов);
		ОписаниеФормы.Вставить("ИмяЭлементаПередКоторымВставлять", "ГруппаСвязанныеСписки");
		
		ОписанияФорм.Вставить(СтрЗаменить("Справочник.Партнеры.Форма.CRM_Модуль_ФормаЭлементаРеквизитыКонтрагентаНовая", ".", "_"), ОписаниеФормы);
		
	КонецЕсли;		
	
	#КонецОбласти
	
	#Область КонтактныеЛицаФормаЭлементаНовая
	
	Если CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM() Тогда
		
		ОписаниеФормы = Новый Структура;
	
		МассивОбластей = новый Массив;
		МассивОбластей.Добавить("ГруппаСведения");
		МассивОбластей.Добавить("ГруппаДополнительно");
		ОписаниеФормы.Вставить("МассивОбластей", МассивОбластей);
		
		МассивИсключаемыхЭлементов = Новый Массив;
		МассивИсключаемыхЭлементов.Добавить("Ссылка");
		МассивИсключаемыхЭлементов.Добавить("ДекорацияАвторДата");
		МассивИсключаемыхЭлементов.Добавить("ГруппаДополнительныеРеквизиты");
		ОписаниеФормы.Вставить("МассивИсключаемыхЭлементов", МассивИсключаемыхЭлементов);
		
		СписокНаборовДопРеквизитов = Новый СписокЗначений;
		СписокНаборовДопРеквизитов.Добавить(Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_КонтактныеЛицаПартнеров);
		ОписаниеФормы.Вставить("СписокНаборовДопРеквизитов", СписокНаборовДопРеквизитов);
		ОписаниеФормы.Вставить("ИмяЭлементаПередКоторымВставлять", "ГруппаСвязанныеСписки");
		
		ОписанияФорм.Вставить(СтрЗаменить("Справочник.КонтактныеЛицаПартнеров.Форма.CRM_ФормаЭлементаНовая", ".", "_"), ОписаниеФормы);	
		
	КонецЕсли;
	
	#КонецОбласти
	
	Для каждого ОписаниеФормы из ОписанияФорм Цикл
		ОписаниеФормы.Значение.МассивИсключаемыхЭлементов.Добавить("ДопНастроитьРасположениеЭлементовФормы");
	КонецЦикла;
	
	Возврат ОписанияФорм;
	
КонецФункции

Процедура РазместитьЭлементыПоНастройке(Форма, ОписаниеФормы = Неопределено) Экспорт
	
	Если ОписаниеФормы = Неопределено Тогда
		ОписаниеНастраиваемыхФорм().Свойство(СтрЗаменить(Форма.ИмяФормы, ".", "_"), ОписаниеФормы);
	КонецЕсли;

	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	CRM_НастройкиРасположенияЭлементовНаФормах.ИмяЭлемента КАК ИмяЭлемента,
	                      |	CRM_НастройкиРасположенияЭлементовНаФормах.ИмяЭлементаРазмещения КАК ИмяЭлементаРазмещения,
	                      |	CRM_НастройкиРасположенияЭлементовНаФормах.ПорядокРасположения КАК ПорядокРасположения,
	                      |	CRM_НастройкиРасположенияЭлементовНаФормах.ЗаголовокЭлемента КАК ЗаголовокЭлемента
	                      |ИЗ
	                      |	РегистрСведений.CRM_НастройкиРасположенияЭлементовНаФормах КАК CRM_НастройкиРасположенияЭлементовНаФормах
	                      |ГДЕ
	                      |	CRM_НастройкиРасположенияЭлементовНаФормах.ИмяФормы = &ИмяФормы
						  |	И CRM_НастройкиРасположенияЭлементовНаФормах.ИмяЭлемента = CRM_НастройкиРасположенияЭлементовНаФормах.ИмяЭлементаРазмещения
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ПорядокРасположения");
	Запрос.УстановитьПараметр("ИмяФормы", Форма.ИмяФормы);
	ВыборкаРазделов = Запрос.Выполнить().Выбрать();
	Если ВыборкаРазделов.Количество()>ОписаниеФормы.МассивОбластей.Количество() Тогда
		ВставлятьРазделыПередИмя = Неопределено;
		ОписаниеФормы.Свойство("ИмяЭлементаПередКоторымВставлять", ВставлятьРазделыПередИмя);
		ВставлятьРазделыПеред = Форма.Элементы.Найти(ВставлятьРазделыПередИмя);
		ГруппаРазделов = Форма.Элементы.Найти("ПользовательскиеРазделыДанных");
		Если ГруппаРазделов = Неопределено Тогда
			Если ВставлятьРазделыПеред = Неопределено Тогда
				ГруппаРазделов = Форма.Элементы.Добавить("ПользовательскиеРазделыДанных", Тип("ГруппаФормы"), );
			Иначе
				ГруппаРазделов = Форма.Элементы.Вставить("ПользовательскиеРазделыДанных", Тип("ГруппаФормы"), ВставлятьРазделыПеред.Родитель, ВставлятьРазделыПеред);
			КонецЕсли;
			ГруппаРазделов.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаРазделов.Отображение = ОтображениеОбычнойГруппы.Нет;
			ГруппаРазделов.ОтображатьЗаголовок = Ложь;
			ГруппаРазделов.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		КонецЕсли;
		Пока ВыборкаРазделов.Следующий() Цикл
			ЭлементРазмещения = Форма.Элементы.Найти(ВыборкаРазделов.ИмяЭлементаРазмещения);
			Если ЭлементРазмещения = Неопределено Тогда
				ЭлементРазмещения = Форма.Элементы.Добавить(ВыборкаРазделов.ИмяЭлементаРазмещения, Тип("ГруппаФормы"), ГруппаРазделов);
				ЭлементРазмещения.Заголовок = ВыборкаРазделов.ЗаголовокЭлемента;
				ЭлементРазмещения.Вид = ВидГруппыФормы.ОбычнаяГруппа;
				ЭлементРазмещения.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
				ЭлементРазмещения.ОтображениеУправления = ОтображениеУправленияОбычнойГруппы.Картинка;
				ЭлементРазмещения.Поведение = ПоведениеОбычнойГруппы.Свертываемая;
				ЭлементРазмещения.Отображение = ОтображениеОбычнойГруппы.Нет;
				ЭлементРазмещения.ЦветТекстаЗаголовка = ЦветаСтиля.CRM_ЧерныйЦветТекста;
				ЭлементРазмещения.ШрифтЗаголовка = Новый Шрифт(,10,);
				ЭлементРазмещения.Скрыть();
				
				Декорация = Форма.Элементы.Добавить("Декорация" + ВыборкаРазделов.ИмяЭлементаРазмещения, Тип("ДекорацияФормы"), ГруппаРазделов);
				Декорация.Вид = ВидДекорацииФормы.Надпись;
				Декорация.Высота = 1;
				Декорация.Шрифт = Новый Шрифт(,1);
				Декорация.ЦветРамки = Новый Цвет(199, 199, 199);
				Декорация.Рамка = Новый Рамка(ТипРамкиЭлементаУправления.ЧертаСверху, 1);
				Декорация.РастягиватьПоГоризонтали = Истина;
				Декорация.РастягиватьПоВертикали = Ложь;
				Декорация.АвтоМаксимальнаяШирина = Ложь;
			Иначе	
				ЭлементРазмещения.Заголовок = ВыборкаРазделов.ЗаголовокЭлемента;
			КонецЕсли;
			Если ВыборкаРазделов.ПорядокРасположения >= ГруппаРазделов.ПодчиненныеЭлементы.Количество() Тогда
			Иначе
				ПередЭлементом = ГруппаРазделов.ПодчиненныеЭлементы[ВыборкаРазделов.ПорядокРасположения-1];
				Если ЭлементРазмещения <> ПередЭлементом Тогда
					Форма.Элементы.Переместить(ЭлементРазмещения, ГруппаРазделов, ПередЭлементом);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ИмяЭлемента = CRM", "ИмяЭлемента <> CRM");
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если ТипЗнч(Выборка.ИмяЭлемента) = Тип("Строка") Тогда
			Элемент = Форма.Элементы.Найти(Выборка.ИмяЭлемента);
		Иначе
			ОписаниеДопРеквизитов = Форма.Свойства_ОписаниеДополнительныхРеквизитов.НайтиСтроки(Новый Структура("Свойство", Выборка.ИмяЭлемента));
			Если ОписаниеДопРеквизитов.Количество() <> 0 Тогда
				ИмяЭлемента = ОписаниеДопРеквизитов[0].ИмяРеквизитаЗначение;
				Элемент = Форма.Элементы.Найти(ИмяЭлемента);
			Иначе
				Элемент = Неопределено;
			КонецЕсли;
		КонецЕсли;
		ЭлементРазмещения = Форма.Элементы.Найти(Выборка.ИмяЭлементаРазмещения);
		Если Элемент<>Неопределено И ЭлементРазмещения<>Неопределено Тогда
			Если Выборка.ПорядокРасположения >= ЭлементРазмещения.ПодчиненныеЭлементы.Количество() Тогда
				Форма.Элементы.Переместить(Элемент, ЭлементРазмещения);
			Иначе
				ПередЭлементом = ЭлементРазмещения.ПодчиненныеЭлементы[Выборка.ПорядокРасположения-1];
				Если Элемент <> ПередЭлементом Тогда
					Форма.Элементы.Переместить(Элемент, ЭлементРазмещения, ПередЭлементом);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
